per1234/InoPlatformPropertiesTest/dummy_architecture/boards.txt
menu.dummy_menu_id=Dummy Menu Title

dummy_board.name=InoPlatformPropertiesTest

dummy_board.upload.tool=dummy_tool
dummy_board.upload.protocol=dummy_protocol

dummy_board.bootloader.tool=dummy_tool

dummy_board.build.core=dummy_core
dummy_board.build.variant=dummy_variant
dummy_board.build.board=DUMMY_ARCHITECTURE_DUMMY_BOARD
dummy_board.build.mcu=atmega328p

dummy_board.dummy_boards_property=dummy_boards_property_value
dummy_board.dummy_override_property=dummy_override_property_value_boards

# Custom board option overrides this, despite the default property's position in the file
dummy_board.dummy_option_property=dummy_option_property_value_default_1

# See: https://arduino.github.io/arduino-cli/dev/platform-specification/#custom-board-options
# When used with the Arduino IDE, the menu selection will be saved to the dummy_option_property property in preferences.txt on exit
dummy_board.menu.dummy_menu_id.dummy_option_id_1=Dummy Option 1 Text
dummy_board.menu.dummy_menu_id.dummy_option_id_1.dummy_option_property=dummy_option_property_value_1
dummy_board.menu.dummy_menu_id.dummy_option_id_2=Dummy Option 2 Text
dummy_board.menu.dummy_menu_id.dummy_option_id_2.dummy_option_property=dummy_option_property_value_2

# Custom board option overrides this, despite the default property's position in the file
dummy_board.dummy_option_property=dummy_option_property_value_default_2
